Autodesk.Revit.DB.Element.DeleteEntity(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Deletes the existing entity created by %schema% in the element
schema:
Schema used for creation of the entity
Returns:
True if entity was deleted, false if entity didn't exist
Throws Autodesk.Revit.Exceptions.ArgumentException:
Writing of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Element.SetEntity(Autodesk.Revit.DB.ExtensibleStorage.Entity)
Stores the entity in the element. If an Entity described by the same Schema already
exists, it is overwritten.
entity:
The Entity to be stored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Writing of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Element.GetEntity(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Returns the existing entity corresponding to the Schema if it has been saved in the
Element, or an invalid entity otherwise.
Remarks:
The Entity that is returned is a copy of the stored data (with copy-on-write
optimization). Modifying it is allowed (even with restricted write), but to save your
changes you must call SetEntity.
schema:
The Schema describing the Entity.
Returns:
The returned Entity.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Reading of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Element.IsCreatedPhaseOrderValid(Autodesk.Revit.DB.ElementId)
Returns true if createdPhaseId and demolishedPhaseId are in order.
createdPhaseId:
The createdPhaseId.
Returns:
True if createdPhaseId index is less than or equal to demolishedPhaseId, otherwise returns false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Element.IsDemolishedPhaseOrderValid(Autodesk.Revit.DB.ElementId)
Returns true if createdPhaseId and demolishedPhaseId are in order.
demolishedPhaseId:
The demolishedPhaseId.
Returns:
True if createdPhaseId index is less than or equal to demolishedPhaseId, otherwise returns false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Element.IsPhaseDemolishedValid(Autodesk.Revit.DB.ElementId)
Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
Remarks:
Acts as a validator for setting the property DemolishedPhaseId.
demolishedPhaseId:
The id of a Phase or invalidElementId.
Returns:
True if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Element.IsPhaseCreatedValid(Autodesk.Revit.DB.ElementId)
Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
Remarks:
Acts as a validator for setting the property CreatedPhaseId.
createdPhaseId:
The id of a Phase.
Returns:
True if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Element.GetChangeTypeGeometry
Returns ChangeType associated with a change in the geometry of an element
Remarks:
Use this change type to trigger an Updater when the geometry of an element
changes. For example, changes like cutting a hole in a wall or
adjusting its height are considered to be geometric changes.
Note: This change type will not trigger on newly created or deleted elements
or on changes caused by Undo and Redo.
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on a geometry change in an element

Autodesk.Revit.DB.Element.GetChangeTypeParameter(Autodesk.Revit.DB.ElementId)
Returns ChangeType associated with a change in a parameter's value
Remarks:
remarks: Use this change type to trigger an Updater when the value of an element's
parameter changes.
Note: This change type will not trigger on newly created or deleted elements or on changes caused by Undo and Redo.
parameterId:
ElementId of parameter for the ChangeType to trigger on.
Returns:
ChangeType that can be used to define a trigger for an Updater,
triggering on parameter value change.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Element.GetParameterFormatOptions(Autodesk.Revit.DB.ElementId)
Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
parameterId:
Id of parameter for which FormatOptions will be returned.
Returns:
Format options of element parameter. If the UseDefault property is true, then no formatting overrides have been defined in the element for the specified parameter, and the FormatOptions for the parameter should be obtained from the Unit object, which can be obtained from the Document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Element.EvaluateParameterValues(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Evaluate the parameters' values of the element on the given parameter ID set.
parameterIds:
Parameter IDs with which the ParameterValue to be retrieved.
Returns:
List of Autodesk.Revit.DB.EvaluatedParameter of the element, which does not include those that cannot be retrieved but are passed in through parameterIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Element.EvaluateAllParameterValues
Evaluates all the parameters' values of the element.
Returns:
List of Autodesk.Revit.DB.EvaluatedParameter of the element.
Since:
2024

Autodesk.Revit.DB.Element.GetMaterialVolume(Autodesk.Revit.DB.ElementId)
Gets the volume of the material with the given id.
materialId:
The material id returned from Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean).
Returns:
The volume of the material for this element.  Returns 0.0 if the material is not a part of this element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
materialId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Element.GetMaterialArea(Autodesk.Revit.DB.ElementId,System.Boolean)
Gets the area of the material with the given id.
materialId:
The material id returned from Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean).
usePaintMaterial:
If true, this material id was returned as a paint material from Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean) and the area returned should be calculated from paint applied to the element.
If false, this material id was returned as a non-paint element material from Autodesk.Revit.DB.Element.GetMaterialIds(System.Boolean) and the area is calculated from the element geometry and layers.
Returns:
The area of the material for this element.  Returns 0.0 if the material id is not a part of this element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
materialId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element element does not support paint material assignment.
Since:
2014

Autodesk.Revit.DB.Element.GetExternalResourceReferenceExpanded(Autodesk.Revit.DB.ExternalResourceType)
Gets the collection of ExternalResourceReference associated with a specified external resource type.
Remarks:
Use this API for an element which has multiple external resource references
under a specified type, e.g., AppearanceAssetElement.
See also: Autodesk::Revit::DB::Element::getExternalResourceReference.
resourceType:
The desired external resource type.
Returns:
The collection of the ExternalResourceReference associated with a specified external resource type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This Element does not use a resource reference for the specified resource type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Element.GetExternalResourceReference(Autodesk.Revit.DB.ExternalResourceType)
Gets the ExternalResourceReference associated with a specified external resource type.
Remarks:
For an element which has multiple external resource references
under a specified type like AppearanceAssetElement, it will return the first one.
See also: Autodesk::Revit::DB::Element::getExternalResourceReferenceExpanded.
resourceType:
The desired external resource type.
Returns:
The copy of the ExternalResourceReference associated with a specified external resource type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This Element does not use a resource reference for the specified resource type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Element.RefersToExternalResourceReference(Autodesk.Revit.DB.ExternalResourceType)
Determines whether this Element uses external resources associated with
a specified external resource type.
resourceType:
The desired external resource type.
Returns:
Returns true if this Element uses external resources associated with
the specified external resource type; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Element.GetExternalResourceReferencesExpanded
Gets the expanded map of the external resource references referenced
by the element.
Remarks:
The value includes all external resource references under the type.
Use this API for an element which has multiple external resource references
under a specified type, e.g., AppearanceAssetElement.
See also: Autodesk::Revit::DB::Element::getExternalResourceReferences.
Returns:
The expanded map of the external resource references referenced by the element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element does not use any external resource.
Since:
2023

Autodesk.Revit.DB.Element.GetExternalResourceReferences
Gets the map of the external resource references referenced
by the element.
Remarks:
For an element which has multiple external resource references
under a specified type like AppearanceAssetElement, the first one will be the value in the map.
See also: Autodesk::Revit::DB::Element::getExternalResourceReferencesExpanded.
Returns:
The map of the external resource references referenced by the element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element does not use any external resource.
Since:
2015

Autodesk.Revit.DB.Element.GetGeometryObjectFromReference(Autodesk.Revit.DB.Reference)
Retrieve one geometric primitive contained in the element given a reference.
Remarks:
It will return the last geometric object in the path.
null will be returned if related geometric object could not be found in the model.
reference:
The geometric object referenced by this instance will be retrieved from the model.
Returns:
The geometric object referenced by the input reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id of this element is not same as that referenced by reference
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element id held by the input reference is not same as the id of this element.
The geometric information could not be taken for this element.
Since:
2012

Autodesk.Revit.DB.Element.CanDeleteSubelement(Autodesk.Revit.DB.Subelement)
Checks if given subelement can be removed from the element.
subelem:
Subelement to check.
Returns:
True if subelement can be removed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Element.DeleteSubelements(System.Collections.Generic.IList{Autodesk.Revit.DB.Subelement})
Removes the subelements from the element.
Remarks:
Depending on implementation for given element as the result, the element
can be deleted - especially if after Subelement deletion there are no Subelement left.
See also: Autodesk.Revit.DB.Element.IsModifiable.
subelems:
Subelements to delete.
Returns:
True if entire element was deleted, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more subelements in subelems do not exist in the element.
-or-
One or more of the subelements subelems cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2018

Autodesk.Revit.DB.Element.DeleteSubelement(Autodesk.Revit.DB.Subelement)
Removes a subelement from the element.
Remarks:
Depending on implementation for given element as the result, the element
can be deleted - especially if after subelement deletion there are no subelements left.
See also: Autodesk.Revit.DB.Element.IsModifiable.
subelem:
The subelement to delete.
Returns:
True if entire element was deleted, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The subelement subelem does not exist in the element.
-or-
Subelement subelem cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2018

Autodesk.Revit.DB.Element.ChangeTypeId(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Changes the type of all elements in the given set.
Remarks:
In some cases, applying a change in type will result in a new element being created.
The only active examples of this are when applying a normal wall type to a curtain panel, or
converting such a wall back to a curtain panel.
Then return map would have (original element id, new element id) pair(s).
Note: this function needs an open transaction.
Note: this function calls regeneration.
document:
The document.
elementIds:
A collection of element IDs.
typeId:
Identifier of the type to assign to this element.
Returns:
The map of original element IDs to the new element IDs
if some elements were replaced by new elements
(the map is empty if no elements were replaced)
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one of the elements in elementIds does not exist in the document
-or-
Not all elements elementIds can have a type assigned.
-or-
The type typeId is not valid for at least one of the elements in elementIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
One or more elements in elementIds is a member of a loaded family.
-or-
One or more elements in elementIds is a member of a group type that is
not being edited.
Since:
2011

Autodesk.Revit.DB.Element.GetValidTypes(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Obtains a set of types that are valid for all given elements.
document:
The document.
elementIds:
A collection of element IDs.
Returns:
A set of element IDs of types that are valid for these elements or an empty set if any element cannot have a type assigned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Element.IsValidType(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Checks if given type is valid for the set of elements.
Remarks:
A type is valid for the set of elements if it is valid for each and every element in the set.
document:
The document.
elementIds:
A collection of element IDs.
typeId:
ElementId of the type to check.
Returns:
True if all elements can have a type assigned and this type is valid for all elements, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Element.CanHaveTypeAssigned(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Checks if all elements in the set can have a type assigned.
document:
The document.
elementIds:
A collection of element IDs.
Returns:
True if all elements in the set can have a type assigned, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Element.ChangeTypeId(Autodesk.Revit.DB.ElementId)
Changes the type of the element.
Remarks:
In rare cases, applying a change in type will result in a new element being created.
The only active examples of this are when applying a normal wall type to a curtain panel, or
converting such a wall back to a curtain panel.
In this situation the new element id is returned.
Also, this element becomes invalid.
See also: Autodesk.Revit.DB.Element.IsModifiable.
typeId:
Identifier of the type to assign to this element.
Returns:
The new element id if new element is created, or InvalidElementId if the element's type changed without creating a new element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type typeId is not valid for this element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element cannot have type assigned.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2011

Autodesk.Revit.DB.Element.IsValidType(Autodesk.Revit.DB.ElementId)
Checks if given type is valid for this element.
Remarks:
A type is valid for an element if it can be assigned to the element.
typeId:
ElementId of the type to check.
Returns:
True if element can have a type assigned and this type is valid for this element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Element.GetGeneratingElementIds(Autodesk.Revit.DB.GeometryObject)
Returns the ids of the element(s) that generated the input geometry object.
Remarks:
This function supports many different types of relationships among elements.
Most of these relationships will return a single element, for example:
Window and door cutting wallsOpenings cutting hostsFace splitting facesWall sweep or reveal traversing wall
A few relationships have the potential for returning multiple elements, including:
Walls joining to other wall(s)Elements extending to roof(s)
If more than one id is returned, one of them (unspecified) is the id of the element that generated the geometry object and the others are ids of related elements. For example, if a wall A is joined to two walls B and C in a way that creates two end faces, and if this function is called for one of the two end faces, it will return the ids of walls B and C.
geometryObject:
The geometry object whose generating element is requested.
Returns:
The id(s) of the element(s) that generated (or may have generated) the given geometry object.  Empty if no generating elements are found. If the set contains just one id, it is the id of the element that generated the geometry object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input geometryObject is invalid and so cannot be used to obtain the generating element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Element.GetPhaseStatus(Autodesk.Revit.DB.ElementId)
Gets the status of a given element in the input phase
phaseId:
Id of the phase.
Returns:
The status of the element in the phase.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id does not represent a valid phase.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Element.DemolishedPhaseId
Id of a Phase at which the Element was demolished.
Remarks:
After setting the property, DemolishedPhaseId regeneration can fail if CreatedPhaseId and DemolishedPhaseId
are out of order with respect to their index in the property Document.Phases.
Can be set to invalid element id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element does not allow setting the property DemolishedPhaseId to the value of demolishedPhaseId.
-or-
When setting this property: Invalid order of phases: An object cannot be demolished before it was created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The element does not have properties CreatedPhaseId and DemolishedPhaseId.
-or-
When setting this property: The element does not allow setting the properties CreatedPhaseId and DemolishedPhaseId.
Since:
2013

Autodesk.Revit.DB.Element.CreatedPhaseId
Id of a Phase at which the Element was created.
Remarks:
After setting the property CreatedPhaseId, regeneration can fail if CreatedPhaseId and DemolishedPhaseId
are out of order with respect to their index in the property Document.Phases.
When Revit is running with UI activated, the default created phase for newly created elements is inherited from the phase of the currently active view.
When Revit is running without its UI, such as when Revit runs on Autodesk Forge Design Automation API for Revit,
the default CreatedPhaseId for newly created elements is the latest phase in Autodesk::Revit::DB::Document::Phases.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element does not allow setting the property CreatedPhaseId to the value of createdPhaseId.
-or-
When setting this property: Invalid order of phases: An object cannot be demolished before it was created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The element does not have properties CreatedPhaseId and DemolishedPhaseId.
-or-
When setting this property: The element does not allow setting the properties CreatedPhaseId and DemolishedPhaseId.
Since:
2013

Autodesk.Revit.DB.Element.VersionId
Get the element version Id.
Remarks:
The application of element version Id is the same as VesionGuid property has, except
that version element Id is stable for migration (between Revit versions) processes.
Element version Id property is internal API as it exposes the bare integer value.
It is not appropriate to make it public API without changing it to return a hash instead.
Any changes to this property will have impact for the ATF Revit Producer's change keys.

Autodesk.Revit.DB.Element.IsModifiable
Identifies if the element is modifiable.
Remarks:
This is not a permanent state. The value depends on the document state. For example, active edit modes can make IsModifiable false for many elements.
Since:
2023

Autodesk.Revit.DB.Element.VersionGuid
Get the element version Guid.
Remarks:
If element version Guid is the same for a certain element in two instances of the saved file
then we guarantee that the two elements are identical. One element version covers a period of time
that is larger than a single transaction: it is a period between two saves, synchronize to central and reload latest.
Thus, in an opened document in-between saves or synchronize actions,
this version cannot be used to determine if any particular element has changed. To watch for element changes happening in-session,
use event Autodesk::Revit::ApplicationServices::Application::DocumentChanged.
Since:
2021

Autodesk.Revit.DB.Element.CanBeHidden(Autodesk.Revit.DB.View)
Indicates if the element can be hidden in the view.
Remarks:
See discussion for some types of elements which may not be hidden.
Note: elements in families can only be hidden temporarily.
Returns: If the element is not permitted to be hidden, false is returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.

Autodesk.Revit.DB.Element.GetParameter(Autodesk.Revit.DB.ForgeTypeId)
Retrieves a parameter from the element given identifier.
parameterTypeId: Identifier of the built-in parameter.
Remarks: Parameters are a generic form of data storage within elements. The parameters are visible
through the Autodesk Revit user interface in the Element Properties dialog. This method uses a
built in parameter identifier to access the parameter. Autodesk Revit has a large number of built in
parameters that are available via static properties.
Throws Autodesk.Revit.Exceptions.ArgumentException:
parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since: 2022